Revit 2027 API
PDFExportOptions.RasterQuality Property
 The preferred raster quality (DPI).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RasterQualityType RasterQuality { get; set; }
Public Property RasterQuality As RasterQualityType
	Get
	Set
public:
property RasterQualityType RasterQuality {
	RasterQualityType get ();
	void set (RasterQualityType value);
}
member RasterQuality : RasterQualityType with get, set
Property Value
RasterQualityType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace